# Реализуйте функцию custom_filter(), которая на вход принимает список some_list,
# с любыми типами данных, находит в этом списке целые числа, отбирает из них те,
# что делятся нацело на 7, суммирует их, а затем проверяет превышает эта сумма 83 или нет.
# Если НЕ превышает - функция должна вернуть True, если превышает - False.
#
# Примечание. В тестирующую систему сдайте программу, содержащую только необходимую
# функцию custom_filter(), но не код, вызывающий ее.
#
# some_list = [7, 14, 28, 32, 32, 56]
#
# print(custom_filter(some_list))

